{
  "basics": {
    "name": "Trevor Atlas",
    "label": "",
    "image": "",
    "email": "hello@trevoratlas.com",
    "phone": "(423) 202-0724",
    "url": "https://trevoratlas.com",
    "summary": "Highly-skilled and motivated senior software engineer with 7+ years of experience. Seeking to draw on proven software development and engineering skills as a future Senior Engineer at __company__.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "Manassas",
      "countryCode": "US",
      "region": "VA"
    },
    "profiles": [{
      "network": "Github",
      "username": "trevor-atlas",
      "url": "https://github.com/trevor-atlas"
    }]
  },
  "work": [{
    "name": "iFIT",
    "position": "Technical Lead / Senior Engineer",
    "url": "https://ifit.com",
    "startDate": "2020-01-07",
    "endDate": null,
    "summary": "iFIT is an interactive fitness platform with a large customer base. Over 2 million workouts are run per month",
    "highlights": [
      "Extended the view layer to have smoother inter-op across various embedded and mobile devices by designing and implementing better data management and simplifying complex data transformations",
      "Deep dives into React/Javascript performance - ensuring that even low-end devices have an acceptable user experience. Reduced 95th percentile load times by 3x and avg. load time by over 1s",
      "Designed and implemented the migration of a shared UI library (React) to a Lerna monorepo with Typescript",
      "Ensured tight cooperation with other engineers and designers through active listening, systematic communication, and leadership skills"
    ]
  },
  {
    "name": "Aquicore",
    "position": "Senior Software Engineer",
    "url": "https://aquicore.com",
    "startDate": "2017-01-01",
    "endDate": "2020-01-05",
    "summary": "Aquicore is a SaaS and IoT company that provides real-time commercial energy management metrics, reporting and automation.",
    "highlights": [
      "Designed and built a text based messaging system with images and @mention capabilities, as well as push and SMS notifications",
      "Designed, prototyped and built out a new front-end in Typescript and React, incrementally migrating from a legacy Angularjs app\nDesigned and implemented many RESTful services including microservices in AWS lambda/cloudfront",
      "Helped architect a mobile app end-to-end in React Native & Typescript",
      "Standardized coding best practices with tools like ESlint, git hooks and CI pipelines"
    ]
  },
    {
      "name": "Knucklepuck Media",
      "position": "Full-stack Developer",
      "url": "https://knucklepuckmedia.com",
      "startDate": "2015-01-12",
      "endDate": "2016-01-12",
      "summary": "Knucklepuck Media is a startup marketing/SEO firm with customers like gap.com and asbestos.com\nI was the first developer hired at Knucklepuck, and designed many of their systems including a google docs exporter for quickly publishing new pages, WordPress plugins that make developers more efficient and a standardized build system/CI pipeline.",
      "highlights": [
        "Designed, built, launched and maintained one of the largest teenage drug rehab sites on the internet (sadly now defunct)",
        "Implemented code quality best practices for the entire organization including code reviews and automated quality checks",
        "Designed infrastructure and shared libraries used by the entire company"
      ]
    }],
  "education": [{
    "institution": "Self Taught",
    "url": null,
    "area": null,
    "studyType":  null,
    "startDate": null,
    "endDate": null,
    "score": null,
    "courses": [
      "As a lifelong autodidact, I have always strove to learn and educate myself to the highest degree possible through online courses, mentorship and actively doing the things that interest me most."
    ]
  }],
  "awards": [],
  "publications": [],
  "skills": [{
    "name": "Typescript/Javascript",
    "level": null,
    "keywords": []
  },
  {
    "name": "React/React-Native",
    "level": null,
    "keywords": []
  },
    {
      "name": "AWS",
      "level": null,
      "keywords": []
    },
    {
      "name": "Terraform",
      "level": null,
      "keywords": []
    },
    {
      "name": "Java",
      "level": null,
      "keywords": []
    },
    {
      "name": "Go",
      "level": null,
      "keywords": []
    },
    {
      "name": "Git",
      "level": null,
      "keywords": []
    },
    {
      "name": "Node",
      "level": null,
      "keywords": []
    },
    {
      "name": "HTML/CSS/SASS",
      "level": null,
      "keywords": []
    }
  ],
  "languages": [{
    "language": "English",
    "fluency": "Native speaker"
  }],
  "interests": [],
  "references": [],
  "projects": []
}
